# Taps
tap "homebrew/bundle"

# Core utilities
brew "coreutils"
brew "less"
brew "watch"
brew "zsh"

# Development tools
brew "ansible"
brew "gcc"
brew "gnupg"
brew "go"
brew "java"
brew "nvm"
brew "shellcheck"

# Git tools
brew "git"
brew "git-cal"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "git-secrets"
brew "git-sizer"
brew "diff-so-fancy"
brew "gh"
brew "gist"
brew "hub"
brew "spaceman-diff"
brew "tig"

# Search and file tools
brew "ack"
brew "fd"
brew "fzf"
brew "ripgrep"

# Data and text processing
brew "htmlq"
brew "jid"
brew "jq"
brew "pup"
brew "shyaml"

# Network and HTTP tools
brew "extract_url"
brew "httpie"
brew "oha"
brew "urlview"
brew "wget"
brew "wrk"

# System and monitoring
brew "cloc"
brew "dockutil"
brew "hyperfine"
brew "mas"
brew "ncdu"
brew "nnn"
brew "pv"

# Documentation and publishing
brew "graphviz"
brew "librsvg"
brew "pandoc"
brew "vale"

# Mail
brew "mutt"
brew "notmuch"
brew "offlineimap"

# Ruby tools
brew "rbspy"

# Security and credentials
brew "pwgen"
brew "ssh-copy-id"

# Editors and development
brew "universal-ctags"
brew "vim"

# Database
brew "sqlite"

# Terminal
brew "tmux"

# Password managers and security
cask "1password"
cask "1password-cli"
cask "keepassxc"

# Browsers
cask "google-chrome"
cask "qutebrowser"

# Development tools
cask "git-credential-manager"
cask "google-cloud-sdk"
cask "iterm2"
cask "ngrok"

# Database clients
cask "sequel-ace"
cask "tableplus"

# File management and utilities
cask "cyberduck"
cask "grandperspective"
cask "table-tool"
cask "the-unarchiver"

# Media and streaming
cask "obs"
cask "streamlabs-obs"
cask "vlc"
cask "yacreader"

# System utilities
cask "flux"
cask "rectangle"

# Mac App Store apps (requires mas CLI)
# Uncomment and add App Store apps as needed
# mas "App Name", id: 123456789
