# Taps
tap "anomalyco/tap"
tap "huseyinbabal/tap"
tap "nikitabobko/tap"
tap "puma/puma"

# Core utilities
brew "coreutils"
brew "findutils"
brew "less"
brew "moreutils"
brew "watch"
brew "zsh"

# Development tools
brew "gcc"
brew "gnupg"
brew "shellcheck"

# Git tools
brew "git"
brew "git-cal"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "git-secrets"
brew "git-sizer"
brew "gh"
brew "tig"

# Search and file tools
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"

# Data and text processing
brew "htmlq"
brew "jid"
brew "jq"
brew "pup"
brew "shyaml"

# Network and HTTP tools
brew "extract_url"
brew "httpie"
brew "mtr"
brew "nmap"
brew "oha"
brew "urlview"
brew "wget"
brew "wrk"

# System and monitoring
brew "cloc"
brew "dockutil"
brew "duti"
brew "hyperfine"
brew "mas"
brew "ncdu"
brew "nnn"
brew "pstree"
brew "pv"

# Documentation and publishing
brew "graphviz"
brew "librsvg"
brew "pandoc"
brew "vale"

# Mail
brew "mutt"
brew "notmuch"
brew "offlineimap"

# Ruby tools
brew "rbspy"

# Security and credentials
brew "pwgen"

# Editors and development
brew "universal-ctags"
brew "vim"

# Database
brew "sqlite"

# Terminal
brew "tmux"

# Password managers and security
cask "1password"
cask "1password-cli"
cask "keepassxc"

# Browsers
cask "google-chrome"
cask "qutebrowser"

# Development tools
cask "git-credential-manager"
cask "ngrok"

# Database clients
brew "harlequin"
cask "sequel-ace"
cask "tableplus"

# File management and utilities
cask "cyberduck"
cask "grandperspective"
cask "table-tool"
cask "the-unarchiver"

# Media and streaming
cask "obs"
cask "vlc"
cask "yacreader"

# System utilities
cask "flux"
cask "obsidian"
cask "rectangle"

# Mac App Store apps (requires mas CLI)
mas "GamepadMapper", id: 1517291304
mas "Keynote", id: 409183694
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835

# Additional packages from current brew installation
brew "ast-grep"
brew "azure-cli"
brew "circleci"
brew "container-diff"
brew "ffmpeg"
brew "git-filter-repo"
brew "glow"
brew "gnu-sed"
brew "heroku"
brew "imagemagick"
brew "jhead"
brew "jp2a"
brew "k9s"
brew "kubelogin"
brew "lazygit"
brew "lefthook"
brew "llm"
brew "mc"
brew "mise"
brew "mkcert"
brew "mysql"
brew "newrelic-cli"
brew "node"
brew "ollama"
brew "anomalyco/tap/opencode"
brew "openvpn"
brew "puma-dev"
brew "rclone"
brew "s3cmd"
brew "socat"
brew "strongswan"
brew "taws"
brew "terraform"
brew "tesseract"
brew "transmission-cli"
brew "ttyd"
brew "usage"
brew "vault"
brew "xsv"
brew "yazi"
brew "yt-dlp"
brew "zsh-completions"

cask "aerospace"
cask "brave-browser@nightly"
cask "comfyui"
cask "datagrip"
cask "docker"
cask "dolphin"
cask "figma"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "lm-studio"
cask "openemu@experimental"
cask "postico"
cask "signal"
cask "spotify"
cask "transmission"
cask "tuple"
cask "vibetunnel"
cask "xquartz"
